网页是网站的必要组成部分，而一个功能丰富的网站不仅仅包括网页，还包括一些资源，如视频文件，声音文件等。
网页又叫web页，实际上是一个文件。存放在和internet相连的某个服务器上，网页又分为静态网页和动态网页。
静态网页：是事先编好后放在站点上的，所有访问同一个页面的用户看到的都是相同的内容
动态网页：能够与访问者进行交互的网页，他能够针对不同访问者的不同访问者的不同需要，将不同的信息反馈给访问者，从而实验与访问者之间的交互

可在web上访问的每一个文件或文档都具有一个唯一的地址，这种地址称为同意资源定位符（URL）。统一资源标识符一词有时可以与URL互换使用，但他是一个更为
一般性的术语，URL只是URI中的一种。
web链接设备使用URL地址在一台特定的服务器上找到一个特定的文件，以便下载他并将它显示给用户

Web URL遵守一种标准的语法，他可以分解为几个主要部分。每个部分都可以向客户端或服务器传达特定的信息，

例如：URL为：http://www.example.com/examples/example.html

http://  代表超文本传输协议，通知example.com服务器显示文本页
www      代表一个web服务器
example.com/  这是装有网页的服务器域名，或者站点服务器的名称
examples/   为该服务器上的子目录，就好像我们的文件夹
example.html 是服务器文件夹中的一个html文件（网页）
。